# SetAlphanumericRevisionSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..SetAlphanumericRevisionSettings Method
RevisionNumberingSequence Class See Also
---
Replaces the current alphanumeric revision numbering settings with the provided settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings settings
)
```

Visual Basic
---
```text
Public Sub SetAlphanumericRevisionSettings ( _
	settings As AlphanumericRevisionSettings _
)
```

Visual C++
---
```text
public:
void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ settings
)
```

# ### Parameters
settings
    Type: Autodesk.Revit.DB..::..AlphanumericRevisionSettings The AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | settings is not a valid AlphanumericRevisionSettings. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace